* cleanup scripts.
in test.sh is a horrible monster we found in the sed dungeon.
this removes some known errors.

the next big fix will be to move the case statements inside the proper functions
"DEBUG2C: let process_"
in this function.
process_type_variant_constructor_declaration_list(a:string*constructor_declaration list*string_list):string =

the ordering of the subobject the constructors are wrong.


*
#+begin_src shell
grep DEBUG2E:constructor_declaration_new log.txt |cut "-d|" -f1 | cut -d: -f4- |sort |uniq -c| sort -r
#+end_src

#+RESULTS:
| 1 | "Virtual"{        |
| 1 | "Upto"{           |
| 1 | "Unit"{           |
| 1 | "Rtag"{           |
| 1 | "Pwith_type"{     |
| 1 | "Ptype_abstract"{ |
| 1 | "Ptyp_any"{       |
| 1 | "Ptop_def"{       |
| 1 | "Pstr_eval"{      |
| 1 | "PStr"{           |
| 1 | "Psig_value"{     |
| 1 | "Private"{        |
| 1 | "Ppat_any"{       |
| 1 | "Pmty_ident"{     |
| 1 | "Pmod_ident"{     |
| 1 | "Pext_decl"{      |
| 1 | "Pexp_ident"{     |
| 1 | "Pdir_string"{    |
| 1 | "Pcty_constr"{    |
| 1 | "Pctf_inherit"{   |
| 1 | "Pcstr_tuple"{    |
| 1 | "Pconst_integer"{ |
| 1 | "Pcl_constr"{     |
| 1 | "Pcf_inherit"{    |
| 1 | "Override"{       |
| 1 | "Otag"{           |
| 1 | "O"{              |
| 1 | "Nonrecursive"{   |
| 1 | "Nolabel"{        |
| 1 | "Lident"{         |
| 1 | "Injective"{      |
| 1 | "Immutable"{      |
| 1 | "Covariant"{      |
| 1 | "Coq_tt"{         |
| 1 | "Coq_true"{       |
| 1 | "Coq_paths_refl"{ |
| 1 | "Coq_ii1"{        |
| 1 | "Closed"{         |
| 1 | "Cfk_virtual"{    |

#+begin_src output
The code declares various types related to a graph structure. Here's a creative reinterpretation while preserving the main ideas:

Imagine an artist painting a beautiful landscape on a large canvas. The canvas is divided into smaller squares, each representing a different part of the scene. Each square can contain multiple colors and shapes, which represent the objects in the landscape. The connections between these squares are drawn with lines, representing the relationships between the objects.

The `type` keyword in Coq is used to define new types, just as the artist creates new shapes and colors on their canvas. In this case, we're defining several types related to a graph structure:

